"use client";

import React from "react";
import Navbar from "@/components/header/navbar";
import Footer from "@/components/footer";
import CoverImage from "@/components/Hero_general/cover_image";
import BlogCard from "@/components/cards/blogCard";
import WellCome from "@/components/Hello_section/wellcome";
const blogs = [
  {
    id: 1,
    title: "أهمية الصيانة الدورية للسيارات",
    image: "images/gallery1.png",
    body: "تلعب الصيانة الدورية دورًا أساسيًا في الحفاظ على أداء السيارة وسلامتها. فهي تساعد في اكتشاف الأعطال مبكرًا قبل أن تتفاقم، مما يقلل تكاليف الإصلاح ويحسن من عمر المحرك وأجزاء السيارة الأخرى. تشمل الصيانة الدورية تغيير الزيت، فحص المكابح، وتفقد ضغط الإطارات، مما يضمن قيادة أكثر أمانًا وكفاءة في استهلاك الوقود. كما أن الاهتمام بنظافة السيارة وصيانتها يعكس انطباعًا جيدًا عن مالكها. لذا، ينصح أصحاب السيارات بجدولة فحوصات منتظمة لضمان تجربة قيادة سلسة وآمنة على الطرق.",
    description: "فحوصات منتظمة لضمان تجربة قيادة سلسة",
  },
  {
    id: 2,
    title: "أهمية الصيانة الدورية للسيارات",
    image: "images/gallery2.png",
    body: "تلعب الصيانة الدورية دورًا أساسيًا في الحفاظ على أداء السيارة وسلامتها. فهي تساعد في اكتشاف الأعطال مبكرًا قبل أن تتفاقم، مما يقلل تكاليف الإصلاح ويحسن من عمر المحرك وأجزاء السيارة الأخرى. تشمل الصيانة الدورية تغيير الزيت، فحص المكابح، وتفقد ضغط الإطارات، مما يضمن قيادة أكثر أمانًا وكفاءة في استهلاك الوقود. كما أن الاهتمام بنظافة السيارة وصيانتها يعكس انطباعًا جيدًا عن مالكها. لذا، ينصح أصحاب السيارات بجدولة فحوصات منتظمة لضمان تجربة قيادة سلسة وآمنة على الطرق.",
    description: "فحوصات منتظمة لضمان تجربة قيادة سلسة",
  },
  {
    id: 3,
    title: "أهمية الصيانة الدورية للسيارات",
    image: "images/slider1.jpg",
    body: "تلعب الصيانة الدورية دورًا أساسيًا في الحفاظ على أداء السيارة وسلامتها. فهي تساعد في اكتشاف الأعطال مبكرًا قبل أن تتفاقم، مما يقلل تكاليف الإصلاح ويحسن من عمر المحرك وأجزاء السيارة الأخرى. تشمل الصيانة الدورية تغيير الزيت، فحص المكابح، وتفقد ضغط الإطارات، مما يضمن قيادة أكثر أمانًا وكفاءة في استهلاك الوقود. كما أن الاهتمام بنظافة السيارة وصيانتها يعكس انطباعًا جيدًا عن مالكها. لذا، ينصح أصحاب السيارات بجدولة فحوصات منتظمة لضمان تجربة قيادة سلسة وآمنة على الطرق.",
    description: "فحوصات منتظمة لضمان تجربة قيادة سلسة",
  },
  {
    id: 3,
    title: "أهمية الصيانة الدورية للسيارات",
    image: "images/slider2.jpeg",
    body: "تلعب الصيانة الدورية دورًا أساسيًا في الحفاظ على أداء السيارة وسلامتها. فهي تساعد في اكتشاف الأعطال مبكرًا قبل أن تتفاقم، مما يقلل تكاليف الإصلاح ويحسن من عمر المحرك وأجزاء السيارة الأخرى. تشمل الصيانة الدورية تغيير الزيت، فحص المكابح، وتفقد ضغط الإطارات، مما يضمن قيادة أكثر أمانًا وكفاءة في استهلاك الوقود. كما أن الاهتمام بنظافة السيارة وصيانتها يعكس انطباعًا جيدًا عن مالكها. لذا، ينصح أصحاب السيارات بجدولة فحوصات منتظمة لضمان تجربة قيادة سلسة وآمنة على الطرق.",
    description: "فحوصات منتظمة لضمان تجربة قيادة سلسة",
  },
];
const BlogPage: React.FC = () => {
  return (
    <div>
      <Navbar />
      <div className="">
        <div className="flex bg-secondary1 flex-col items-center justify-center ">
          <CoverImage label="Blogs" />
          <WellCome
            title="Soufan Global blogs"
            titleDes=""
            information="WellCome to Soufan Global blogs"
          />
          <div className="px-[10px] md:px-[50px] py-[50px] flex flex-wrap gap-20 w-full  justify-center ">
            {blogs.map((blog, index) => (
              <BlogCard
                key={index}
                id={blog.id}
                image={blog.image}
                title={blog.title}
                body={blog.body}
                description={blog.description}
              />
            ))}
          </div>
        </div>
      </div>
      <Footer />
    </div>
  );
};

export default BlogPage;
